Revit 2024 API
WorksharingTooltipInfo Members
The WorksharingTooltipInfo type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the WorksharingTooltipInfo
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetRequesters
 The ordered list of unique user names of users who have outstanding editing requests for the specified element.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Creator
 The user name of the user who created the element.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LastChangedBy
 The user name of the most recent user who saved a user change of this element to the central model.
Owner
 The current owner of the element or empty string if no one owns the element.
See Also
WorksharingTooltipInfo Class
Autodesk.Revit.DB Namespace